In [2]:
# 시리즈 연산 : 시리즈 연산식 숫자 -> 시리즈의 각 원소에 숫자 연산
import pandas as pd

sr = {'국어' : 100, '영어' : 90, '수학' : 80}
sr = pd.Series(sr)

In [4]:
# 시리즈 사칙연산(+, -, *, /) 숫자
print("before {} : after {}".format( sr, sr + 10))
print("before {} : after {}".format( sr, sr - 10))
print("before {} : after {}".format( sr, sr * 10))
print("before {} : after {}".format( sr, sr / 10))

before 국어    100
영어     90
수학     80
dtype: int64 : after 국어    110
영어    100
수학     90
dtype: int64
before 국어    100
영어     90
수학     80
dtype: int64 : after 국어    90
영어    80
수학    70
dtype: int64
before 국어    100
영어     90
수학     80
dtype: int64 : after 국어    1000
영어     900
수학     800
dtype: int64
before 국어    100
영어     90
수학     80
dtype: int64 : after 국어    10.0
영어     9.0
수학     8.0
dtype: float64

In [6]:
# 시리즈 사칙연산(+,-,*,/) 시리즈
import numpy as np
sr1 = pd.Series({'국어':np.nan, '영어':90, '수학':80})
sr2 = pd.Series({'국어':80, '영어':70, '수학':90, '과학':100})
sr1 + sr2

과학      NaN
국어      NaN
수학    170.0
영어    160.0
dtype: float64

In [7]:

sr1 = pd.Series({'국어':np.nan, '영어':90, '수학':80})
sr2 = pd.Series({'국어':80, '영어':70, '수학':90, '과학':100})
sr1 + sr2

과학      NaN
국어      NaN
수학    170.0
영어    160.0
dtype: float64

In [15]:
# 연산 메소드 : 시리즈.add(시리즈1), sub(), mul(), div()
sr_add = sr1.add(sr2, fill_value=0) # Nan 데이터를 0으로 대치, nan데이터처리 중요 !!
sr_sub = sr1.sub(sr2, fill_value=0)
sr_mul = sr1.mul(sr2, fill_value=0)
sr_div = sr1.div(sr2, fill_value=0)
print("{}, {}, {}, {}".format(sr_add, sr_sub, sr_mul, sr_div))

과학    100.0
국어     80.0
수학    170.0
영어    160.0
dtype: float64, 과학   -100.0
국어    -80.0
수학    -10.0
영어     20.0
dtype: float64, 과학       0.0
국어       0.0
수학    7200.0
영어    6300.0
dtype: float64, 과학    0.000000
국어    0.000000
수학    0.888889
영어    1.285714
dtype: float64

In [11]:
import seaborn as sns 

titanic = sns.load_dataset('titanic')
titanic.head()
df = titanic.loc[ : , ['age', 'fare']]
print(df.head())   # head() -> 처음부터 5개만 보여줌, tail() 뒤에서 5개만 보여 줌, ()안에 숫자만큼 보여줌
df.tail()
print(sns.get_dataset_names())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'taxis', 'tips', 'titanic']

In [12]:
df+10

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [13]:
titanic.info() # str -> 판다스에서는 object로 표현

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [14]:
df.add(10, fill_value=0)

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888  10.0  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [16]:
titanic.loc[0:10, ['sex', 'class']]

       sex   class
0     male   Third
1   female   First
2   female   Third
3   female   First
4     male   Third
5     male   Third
6     male   First
7     male   Third
8   female   Third
9   female  Second
10  female   Third

In [17]:
titanic.iloc[[0,1], [0,2]] # iloc -> 정수 인덱스, loc => 인덱스명과 컬럼명  # ???

   survived     sex
0         0    male
1         1  female

In [18]:
# 외부 파일을 읽어서 데이터프레임 생성
# pd.read_csv(파일명) -> ',' 또는 구분자로 분리된 자료를 읽어 옴
file_path = './dataset/read_csv_sample.csv'
df = pd.read_csv(file_path,header=None) # header 지정하지 않음  
# df = pd.read_csv("./dataset/read_csv_sample.csv")
df

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [19]:
import os
os.getcwd()  # 경로 찾는 법 
# !dir
# ./dataset/read_csv_sample.csv

'c:\\Users\\chanb\\pandas'

In [29]:
df = pd.read_csv(file_path) # 0 라이의 자료를 컬럼으로 인식  
df

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [35]:
df = pd.read_csv(file_path, index_col='c0') # index 컬럼 지정 
df

    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9

In [20]:
# excel 파일 read : read_excel(파일명, 옵션)
file_path = './dataset/남북한발전전력량.xlsx'
df = pd.read_excel(file_path)#, header=None) # df.to_excel("파일명")
df.head()  # 조회일뿐 원본은 그대로 
df.to_excel("sample_excel.xlsx",index=False)

In [22]:
file_path = './dataset/read_json_sample.json'
df = pd.read_json(file_path)
df

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

In [23]:
file_path = './dataset/sample.html'
tables = pd.read_html(file_path)
tables

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [24]:
df = tables[1]
df.reset_index(inplace=True) # name을 인덱스로 설정

In [25]:
df.set_index('name', inplace = True)
df

            index  year        developer  opensource
name
NumPy           0  2006  Travis Oliphant        True
matplotlib      1  2003   John D. Hunter        True
pandas          2  2008    Wes Mckinneye        True

In [26]:
# 여러 개의 데이터프레임을 하나의 excel 파일로 저장하기
data1 = {'name':['Jerry', 'Riah', 'paul'],
        'algol' : ['A', 'A+', 'B'],
        'basic' : ['A+', 'F', 'B'],
        'c++' : ['B', 'C+', 'A']}
data2 = {'c0' : [1,2,3],
        'c1' : [4,5,6],
        'c2' : [7,8,9],
        'c3' : [10,11,12]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [27]:
df1.set_index('name', inplace=True)
df2.set_index('c0', inplace=True)

In [28]:
df2
wp = pd.ExcelWriter('./dataset/df_excel.xlsx')  # fp = open(파일명, 모드)
df1.to_excel(wp, sheet_name='sheet1')
df2.to_excel(wp, sheet_name='sheet2')